{"meta":{"title":"Toonen.io","subtitle":null,"description":null,"author":"Peter Toonen","url":"https://toonen.io"},"pages":[],"posts":[{"title":"New Blog","slug":"new-blog","date":"2016-07-09T21:09:34.000Z","updated":"2016-07-09T21:51:35.958Z","comments":true,"path":"2016/07/09/new-blog/","link":"","permalink":"https://toonen.io/2016/07/09/new-blog/","excerpt":"","text":"So as you may have noticed, I have started a new blog. It’s been a long time coming but I finally found some time this weekend. My colleague Edwin van Wijk tipped me off on using hexo quite a while ago and I seem to have gotten the hang of it. This blog itself is still a work in progress and I’ll be migrating old posts over soon, but in the meanwhile I figured I’d share some tips. Free BlogAs you might know, GitHub offers you a free website through GitHub Pages. This means that you can host your static website right from GitHub. Combine this with Hexo magic and you can start your own blog quite easily. What you might not know is that you can also add a custom domain to your GitHub page: Now although this by itself is pretty cool, it gets better. Although it’s possible to use SSL on GitHub pages, this isn’t currently possible when using a custom domain, or is it? CloudFlare to the rescueCloudFlare offers a free tier that not only makes your website faster by using a smart caching mechanism (which you might want to turn off seeing as hexo generates static content), it also offers free SSL for all sites. Simply register for a free account on their site, go to the ‘DNS’ tab and add a CNAME for your domain, like so: For the DNS-savvy, yes, I used a CNAME as my domain’s root, please refer to this page on details as to why this is still RFC compliant. Then nagivate to the ‘Crypto’ tab in the menu and set it to the following: Now for the final step, which ensures all your users are automatically redirected to your SSL page, navigate to the ‘Page Rules’ tab and add the following rules (where you replace the domain with your own domain). If you use a sub-domain such as ‘blog.domain.com’, make sure to use two asterisks (*) in the first rule and replace $1 in the rule with $2 so that it will correctly rewrite: In case you do want to disable caching to prevent issues with your static site, enable a third rule where you match https://yourdomain.ext/* and set the action to ‘Cache Level = ByPass’: Sit back and relaxThat’s it. You’re done. You have just setup your new secure site using hexo, GitHub pages and CloudFlare. Of course you can also use this with the Basic Tier in Azure which allows you to use your own custom SSL for just 8 odd euro’s a month ;-)","categories":[],"tags":[{"name":"general, tips-and-tricks","slug":"general-tips-and-tricks","permalink":"https://toonen.io/tags/general-tips-and-tricks/"}]}]}